[{
    "beverage": null,
    "categories": [
      "Present Day"
    ],
    "clean_title": "January 19, 2017",
    "coverage_date": "January 19, 2017",
    "coverage_end_date": "January 19, 2017",
    "coverage_start_date": "January 19, 2017",
    "details_html": "<div class=\"libsyn-item-body\">\n<p>On today's episode, Dan tells Jordan about what has happened in the world of Alex Jones in the last week, particularly on January 19, 2017. Topics covered include:</p> <ul> <li>Why aren't you mad that clones don't have rights?</li> <li>Does a tape of Trump saying the N-word exist?</li> <li>If it does exist, what should Trump do about it?</li> <li>Is kissing your wife sexual assault?</li> </ul>\n</div>",
    "download_link": "https://traffic.libsyn.com/secure/knowledgefight/1-19.mp3",
    "embed_player_url": "https://html5-player.libsyn.com/embed/episode/id/5009104/height/90/theme/custom/thumbnail/yes/direction/forward/tdest_id/461807/render-playlist/no/custom-color/87A93A/",
    "episode_length": "01:48:52",
    "episode_number": "5",
    "episode_type": "Present Day",
    "libsyn_page": "https://knowledgefight.libsyn.com/knowledge-fight-jan-19-2017",
    "mediawiki_citations": [
      "The world on Jan 19, 2017<ref>[https://knowledgefight.com/the-past/2017/5/15/jan-19-2017 Jan 19, 2017]</ref>:\n\n*This was the last day before Donald Trump would officially be inaugurated as president. Many attempts had been made to avoid that turn of events, from lobbying the Electoral College, to Jill Stein's attempts at recounts, but the inevitable came to pass.\n*In one of his last days in office, President Obama commutes the sentence of Chelsea Manning.\n*Trump's pick for Secretary of The Interior, Ryan Zinke said in his confirmation hearing that he would consider reviewing the ban on arctic drilling.\n*Trump's pick for Secretary of Education, Betsy DeVos was caught in a couple tough situations in her confirmation hearing. The first was when she claimed that she was listed as the Vice President of her mother's foundation on tax forms for multiple years due to a \"clerical error.\" The other was the revelation that she and her husband have investments in student debt collection agencies.\n*Almost 60 members of Congress announce their intention to not go to Trump's inauguration.\n*People are out protesting pipelines in Texas, Tennessee, Florida, and North Dakota.\n\nWhat was happening with Alex Jones:\n\n*Alex was broadcasting from Washington D.C. in anticipation of the inauguration of Donald Trump. This was to be a culmination of everything he had worked so hard for, but Alex's thoughts were clearly elsewhere. Instead of enjoying this victory, Alex spent almost his entire show implying that Democrats were planning not to show up because they had foreknowledge of a terrorist plot against the ceremony.\n*Alex claimed on this episode that the way that the Democrats (or Globalists) would take out Donald Trump was C.O.G. (Continuity of Government). Continuity of Government is a term that describes having a plan for the government to continue in crisis situations. Most world governments have established orders of succession in place, and our Continuity of Government plans date back to the earliest days of our country, when we were worried about the British capturing our heads of state or even the entirety of the Continental Capital city of Philadelphia. What C.O.G. is not is a plan to assassinate a leader, it is a formulated plan to make sure that our actual government survives attacks. It sounds kind of smart to dumb people though, so Alex ran with it.\n*Alex, sensing that it is too late for anyone to do anything about it, reveals that Donald Trump has been an Anti-Globalist sleeper cell since the 60's. It's an absurd idea, and looks very embarrassing in hindsight. This revelation continues into Alex being really weirdly defensive about people thinking he hates gay people. He also is sick of black people thinking he hates black people, and he admits that his ancestors owned slaves. It's a confusing road.\n*Alex does his world-famous impression of Cookie Monster.\n*Alex continued his persecution complex, going so far as to suggest that \"people from the Establishment\" have been hissing at him while he's been in DC. I cannot prove that this hissing incident did not happen, but I am certain it did not happen at all how Alex describes\n*As a show of impartiality, Alex (along with Rob Dew) gives a very subtle plug for Trump's new hotel on his broadcast. It was, undoubtedly, an unpaid advertisement.\n"
    ],
    "mediawiki_description": "On today's episode, Dan tells Jordan about what has happened in the world of Alex Jones in the last week, particularly on January 19, 2017. Topics covered include:\n\n*Why aren't you mad that clones don't have rights?\n*Does a tape of Trump saying the N-word exist?\n*If it does exist, what should Trump do about it?\n*Is kissing your wife sexual assault?\n",
    "next_episode_number": "6",
    "next_title": "6: Inauguration Speech Recap",
    "notable_bits": [
      "Alex says weeny"
    ],
    "ofile": "kf_wiki_content/5{{COLON}}_January_19,_2017.wiki",
    "ooc_drop": null,
    "people": [],
    "prev_episode_number": "4",
    "prev_title": "4: Research and Stand Up",
    "release_date": "January 20, 2017",
    "safe_clean_title": "January 19, 2017",
    "safe_next_title": "6: Inauguration Speech Recap",
    "safe_prev_title": "4: Research and Stand Up",
    "safe_title": "5: January 19, 2017",
    "slug": "5{{COLON}}_January_19,_2017",
    "sortkey": "#_EPISODE_0005:January 19, 2017",
    "sources": [],
    "themes": [
      "Alex does cookie monster/Putin impression",
      "First blood on cuckolds",
      "Alex's dad is a dentist"
    ],
    "title": "5: January 19, 2017"
  },
  {
    "beverage": "white wine",
    "categories": [
      "Present Day"
    ],
    "clean_title": "March 6 & Celebrity Cameos",
    "coverage_date": "March 6, 2017",
    "coverage_end_date": "March 6, 2017",
    "coverage_start_date": "March 6, 2017",
    "details_html": "<div class=\"libsyn-item-body\">\n<p>Today, Dan tells Jordan all about what happened on the March 6th episode of The Alex Jones Show, plus they discuss celebrity drop-ins from \"lovable weirdo\" Eddie Bravo and \"potentially a Nazi\" Jesse James.  Topics discussed include:</p> <ul> <li>Are Gen. Flynn and Jeff Sessions the real victims?</li> <li>Is listening to Alex Jones unofficially required of servicemen?</li> <li>Does Alex think that random memes are \"primary sources?\"</li> <li>Can one be both a literal and metaphorical vampire?</li> </ul> <p> </p>\n</div>",
    "download_link": "https://traffic.libsyn.com/secure/knowledgefight/Mar6-8.mp3",
    "embed_player_url": "https://html5-player.libsyn.com/embed/episode/id/5163680/height/90/theme/custom/thumbnail/yes/direction/forward/tdest_id/461807/render-playlist/no/custom-color/87A93A/",
    "episode_length": "02:16:19",
    "episode_number": "20",
    "episode_type": "Present Day",
    "libsyn_page": "https://knowledgefight.libsyn.com/knowledge-fight-march-6-celebrity-cameos",
    "mediawiki_citations": [],
    "mediawiki_description": "Today, Dan tells Jordan all about what happened on the March 6th episode of The Alex Jones Show, plus they discuss celebrity drop-ins from \"lovable weirdo\" Eddie Bravo and \"potentially a Nazi\" Jesse James.  Topics discussed include:\n\n*Are Gen. Flynn and Jeff Sessions the real victims?\n*Is listening to Alex Jones unofficially required of servicemen?\n*Does Alex think that random memes are \"primary sources?\"\n*Can one be both a literal and metaphorical vampire?\n",
    "next_episode_number": "21",
    "next_title": "21: March 9, 2017",
    "notable_bits": [
      "Sandra Bullock is a Nazi"
    ],
    "ofile": "kf_wiki_content/20{{COLON}}_March_6_&_Celebrity_Cameos.wiki",
    "ooc_drop": "Now here's the big enchilada",
    "people": [
      "Reince Priebus",
      "Jeff Sessions",
      "Matt Drudge",
      "Eddie Bravo",
      "Jesse James",
      "Sandra Bullock",
      "Steve Pieczenik"
    ],
    "prev_episode_number": "19",
    "prev_title": "19: March 3, 2017",
    "release_date": "March 13, 2017",
    "safe_clean_title": "March 6 & Celebrity Cameos",
    "safe_next_title": "21: March 9, 2017",
    "safe_prev_title": "19: March 3, 2017",
    "safe_title": "20: March 6 & Celebrity Cameos",
    "slug": "20{{COLON}}_March_6_&_Celebrity_Cameos",
    "sortkey": "#_EPISODE_0020:March 6 & Celebrity Cameos",
    "sources": [],
    "themes": [
      "First instance of Dan interupting Jordan with a clip",
      "Alex is now obsessed with saying the expression \"now here's the big enchilada\"",
      "Alex says that Reince Preibus is sneakily going around telling Trump admininstation officials to resign",
      "Dan says that their game is off because they are drinking white wine",
      "Celebrity cameos",
      "Introduction of Steve Pieczinik but Pieczinik doesn't appear in any clips",
      "Jesse James and Sandra Bullock are Nazis"
    ],
    "title": "20: March 6 & Celebrity Cameos"
  },
  {
    "beverage": "Faygo Cotton Candy",
    "categories": [
      "2015 Investigation"
    ],
    "clean_title": "July 6-13. 2015",
    "coverage_date": null,
    "coverage_end_date": "July 13, 2015",
    "coverage_start_date": "July 6, 2015",
    "details_html": "<div class=\"libsyn-item-body\">\n<p>Today, Dan tells Jordan all about the third installment of his investigation into what happened to Alex Jones in 2015 to get him on board with the Trump campaign. Topics covered include:</p> <ul> <li>What InfoWars employee's uncle is investigating Sandy Hook?</li> <li>What is a \"controlled rage?\"</li> <li>Does Larry Nichols outdo himself in terms of dumb theories?</li> <li>How mad can one man get at a trailer for an MTV show?</li> </ul>\n</div>",
    "download_link": "https://traffic.libsyn.com/secure/knowledgefight/Investigation3.mp3",
    "embed_player_url": "https://html5-player.libsyn.com/embed/episode/id/5418460/height/90/theme/custom/thumbnail/yes/direction/forward/tdest_id/461807/render-playlist/no/custom-color/87A93A/",
    "episode_length": "02:38:12",
    "episode_number": "49",
    "episode_type": "2015 Investigation",
    "libsyn_page": "https://knowledgefight.libsyn.com/knowledge-fight-july-6-13",
    "mediawiki_citations": [
      "The world on July 6, 2015<ref>[https://knowledgefight.com/the-past/2015/7/6/july-6-2015 July 6, 2015]</ref>:\n\n*61% of Greek citizens vote to reject austerity conditions for a financial bailout. The situation seems very uncertain, but most are encouraged by the Greeks taking control of their future.\n*Nuclear talks with Iran continue in Vienna, after they recently were given an extension when sides could not reach an agreement by the established deadline. John Kerry expresses the position that, at this point, things could go either way.\n*Pope Francis begins an eight-day tour of South America, beginning in Ecuador, promoting a campaign of environmentalism.\n\nWhat Alex covered on July 6th:\n\n*This show is very weird. Alex appears to be in a very weird mood, which leads to this moment in the middle of the episode where Alex reveals that he almost couldn't go on air that day.\n*After he screams his way into a break, he comes back after the commercials and explains that he engaged in a \"controlled rage\" during the break and he now feels better. This seems to be something that he does a lot, and indicates that he may not be very able or willing to engage in healthy anger management techniques.\n*It appears that one of the reasons that Alex is in such a bad mood is because he only takes in news from propaganda outlets. On this episode, he explains his media routine, and it seems to mostly include reading stories posted on InfoWars (his own website), and reading the comments looking for \"tips.\" It is a fascinating glimpse into how even the man making all the money and controlling the organization is still hurt by the influence of propaganda.\n*Because Alex has worked himself up into such a bad mood by reading dishonest stories on his own website, he is in no shape to actually do a show. He spends most of the show taking callers who all agree with him.\n*In the middle of a jag about how he doesn't want people to make him feel \"white guilt,\" Alex reveals that even Jerome Corsi, a man who has known Donald Trump for 40 years, has told Alex that Trump is a shill. Everyone who eventually comes to support Trump are going on record as having inside knowledge that he's not to be trusted.\n*Alex tells a story about hanging out with Willie Nelson that is supposed to explain that Alex sells quality products because he doesn't want people to boo him, but ends up revealing that he is a bit of a prude.\n*Alex conducts an interview with \"trends researcher\" Gerald Celente. A lot of it is about the impending financial collapse, and they do recommend that people buy gold, a recurring theme on programs supported by Genesis Communications Network.\n",
      "The world on July 7, 2015<ref>[https://knowledgefight.com/the-past/2015/7/7/july-7-2015 July 7, 2015]</ref>:\n\n*61% of Greek citizens vote against a bailout of their economy involving austerity measures. Greek banks remain closed, and negotiations continue regarding emergency loans.\n*A Saudi-led coalition carries out strikes in Yemen, killing at least 200, many of which were civilians.\n*President Obama vows to continue the offensive on ISIS, saying \"Our airstrikes will continue to target the oil and gas facilities that fund so much of their operations. We're going after the ISIL leadership and infrastructure in Syria, the heart of ISIL that pumps funds and propaganda to people around the world.\"\n*New York City agrees to a $300,000 settlement in a case brought against them by six Occupy protesters who were pepper sprayed by Officer Anthony Bologna, while they were peacefully demonstrating and caught behind a police crowd control net.\n*A study finds that, of the 2.400 elected prosecutors in America, 95% are white. The study further found that 79% are white men. In 66% of the states that elect prosecutors, none are African Americans. This creates an immense bias in the legal system that is often ignored when reform is discussed.\n*Court documents from 2005 are released wherein Bill Cosby admitted that he gave quaaludes to women he intended to have sex with. Somehow he is still not in prison.\n\nWhat Alex covered on July 7th:\n\n*A lot of the show was spent intentionally misleading the audience about what President Obama recently said about the fight against ISIS (or ISIL, as Obama calls them). The substance of what Obama said is that, in the case of terrorism, military might is not enough to defeat them. What is required is a better ideology. Alex intentionally misunderstands his comments to mean that Obama is saying that we are not going to attack ISIS because they are his personal proxy army to kill Christians. The reason he does this is because, if he did not misinterpret the comments this way, he would have to admit that he agrees with Obama about something substantive (Alex constantly talks about how \"Americana\" will inspire the world, etc).\n*Alex conducts an interview with Lord Monckton, a British gentleman who believes the EU is a fascist organization that is doomed to failure. An interesting conversation could be had about how things are particularly doomed to fail when parties actively work against them, but that is not the conversation that the two men have.\n*Alex gets defensive about Jade Helm. Many people believed that Jade Helm was a planned army takeover of Texas (among other parts of the country deemed \"hostile\"). Alex claims that he never said it was real, just that it was conditioning the public to prepare for an eventual war against patriots. It's a fine line to draw, and I cannot comment on whether or not his claims about his coverage are true. This will be updated as evidence is found.\n*Alex talks about his experience going back to Bohemian Grove on the History Channel show Decoded with Brad Meltzer. His telling of the events makes enough sense, when he is talking about this reality TV visit to the Grove. However, it is very important to note that Alex Jones, most likely, was completely lying about his initial \"infiltration\" of Bohemian Grove. Alex claims that he \"exposed\" the existence of the grove, but you can see here [https://www.youtube.com/watch?v=N0NAHmtAG00 a news story from ABC about Bohemian Grove from 1981], a full 19 years before Alex's \"documentary.\" Further, journalist Philip Weiss sneaked into Bohemian Grove in 1989 for six whole days, [http://www2.ucsc.edu/whorulesamerica/power/bohemian_grove_spy.html and wrote an extensive article about it], and really described the Grove as being basically a drunk summer camp for rich dudes (he experienced everything that Alex talked about, like the Cremation of Care ceremony, he just experienced it in context, and doesn't have a vested interest in selling fear). Further, consider these two videos, each pointing out very serious problems with Alex Jones' Bohemian Grove documentary. The first discusses how Alex doesn't actually have footage of any of the things he talks about in the video. The second discusses the geographical problems, how Alex's account of where he claims he went just does not match up with Google maps, or the Grove's own maps.\n*Alex spends a lot of time on this episode announcing that news director Rob Dew's uncle, a former FBI agent, is \"investigating Sandy Hook.\" In 2017, Alex Jones claims that he never said that Sandy Hook was a fake event, but we have shown time and again that he did make those claims repeatedly, and in varying contexts. Below, you will find a clip of him telling a caller that no kids died at Sandy Hook, and under that, is the actual audio from Dew's uncle that they are basing their new reporting on. He says nothing other than that \"he's never seen something like\" this, which most people would say about the senseless murder of schoolchildren. Alex repeats many thoroughly debunked claims put forth by unscrupulous sources, and cites the work of discredited opportunist/victim family harasser Wolfgang Halbig. It is an embarrassment to journalism, and decency.\n",
      "[https://www.democracynow.org/2015/7/8/headlines The world on July 8, 2015]<ref>[https://knowledgefight.com/the-past/2016/7/8/july-8-2015 July 8, 2015]</ref>:\n\n*In testimony before the Senate Armed Services Committee, Defense Secretary Ash Carter reveals that our program to train and arm moderate Syrian rebels has not been as successful as they had hoped. Due to intense screening requirements, the program only had 60 members that could be trained. This program has cost taxpayers $500 million in 2015\n*Guatemalan government backed sponsors have testified that former dictator Efraín Ríos Montt is not mentally competent to stand trial for genocide, as he oversaw the killings of 2,000 Ixil Mayans. Experts say the 89 year old is unable to understand the charges brought against him.\n*New York City announces plans to get rid of bail for low-level and non-violent offenders. Protesters called for this after multiple deaths occurred in Rikers Island, including the suicide of Kaleif Browder, a 22 year old who spent 3 years in Rikers after being accused of stealing a backpack, but he could not afford the $3,000 bail. He maintained his innocence, and the charges were dropped, but his death was an absolutely avoidable tragedy.\n\nWhat Alex covered on July 8th:\n\n*Previously, Alex was predicting that the financial collapse was going to come \"this summer.\" Since we are a week into July, on this episode, Alex adjusts his prediction to winter.\n*Alex expresses support for Nigel Farage and UKIP. They are reasonable allies, as they both hate the EU, but since events transpire the way they do over the next 18 months, it is important to point out what changed about Alex's positions and what did not.\n*Alex tells a story that probably didn't happen about people on the streets of Austin insulting him for supporting Trump. In this clip, we begin to see the external world forcing Alex and Trump into a similar box. All the same, Alex still denounces Trump. \"Trump has never been my boy,\" he says. Alex compares Trump to the commotion about the Confederate Flag or Caitlyn Jenner, in terms of being a manufactured distraction.\n*Alex conducts interviews with Greg Palast (about the troubles in Greece), and Harry Dent (about how the economy of China is a fraud).\n",
      "[https://www.democracynow.org/2015/7/9/headlines The world on July 9, 2015]<ref>[https://knowledgefight.com/the-past/2015/7/9/july-9-2015 July 9, 2015]</ref>:\n\n*The Guardian reports that Exxon knew about climate change in 1981, a full seven years before it became a matter of public debate. Internal emails show that they were fully aware of the science back then, and engaged in a campaign to fund climate change denial to the tune of at least $30 million over 30 years.\n*Democratic presidential candidates Bernie Sanders and Martin O'Malley, as well as the Green Party candidate Jill Stein, have promised to not accept any campaign donations from fossil fuel companies.\n*Baltimore Mayor Stephanie Rawlings-Blake fires Police Commissioner Anthony Batts over his handling of the arrest of Freddie Gray, who died in police custody under very suspicious circumstances. Further, the Baltimore police union issued a review accusing Batts of ordering officers to allow looting and property destruction during an uprising over Gray's death, which left 19 buildings burned.\n*California Congressmember Barbara Lee introduces the Equal Access to Abortion Coverage in Health Insurance Act, or EACH Woman Act, hoping to invalidate the Hyde Amendment which bans federal funding for abortion.\n*FBI Director James Comey testifies before the Senate that the FBI needs backdoor access to encrypted devices and software. Tech companies have come out against this, warning that the dangers to privacy outweigh the potential security assistance.\n*The UN announces that the refugee population due to the Syrian War has exceeded 4 million, and that due to hostilities, an estimated 7.6 million people have been displaced. Antonio Guterres, U.N. high commissioner for refugees, said, \"This is the biggest refugee population from a single conflict in a generation.\"\n\nWhat Alex covered on July 9th:\n\n*Almost this entire show is about how mad Alex is about a trailer for a show on MTV called White People. The show is intended to teach white youth about the nature of cultural privilege, not to convince them that they are evil, but that they live in a set of circumstances that have come into being because of outright oppression of minorities. Alex does not understand this, and his defensiveness about his white identity almost drives him to the point of insanity while covering this trailer.\n*Alex alleges that he has been attacked by black people more than Martin Luther King Jr was attacked by white people, which is basically an insultingy reductive take on the Civil Rights Movement. Alex believes that the street fights he got into as a kid were him being racially targeted, which is something too absurd for us to unpack here.\n*Alex conducts an interview with Larry Nichols, which is involves a couple of main points. First, Larry needs money. He has medical bills and is appealing to Alex's audience to help. Second, he wants everyone to know that the Clintons were swingers (in addition to witches), and that Chelsea isn't Bill's daughter. Lastly, he wants to explain to the audience that Barack Obama is trying to turn the US into a Muslim caliphate, which would then make him the leader of Islam globally. It's an absurd premise, and you can hear him explain it in the below clip.\n*Alex thinks that doctors and schools are trying to convince kids, who would not be inclined to do so otherwise, to be gay or trans. He relies on a very misleading, inconclusive, and unprofessional video from Joe Biggs to make these completely insane claims. It is an embarrassing look at a man who really believes in a \"gay agenda.\"\n",
      "David Knight hosted the show, so we didn't really care to find out what was being discussed.<ref>[https://knowledgefight.com/the-past/2017/7/17/july-10-2015 July 10, 2015]</ref>\n\nHowever, we accidentally scanned through the episode and landed on this clip, where David Knight laments how everyone misunderstands and maligns the very racist Disney movie Song of The South.\n",
      "'''The world on July 12th'''<ref>[https://knowledgefight.com/the-past/2017/7/17/july-12-2015 July 12, 2015]</ref>:\n\n*Coming Soon\n\n'''What Alex covered on July 12''':\n\n*Alex still thinks that Trump is a shill for Hillary Clinton. He says he still \"doesn't trust him,\" but still is wrestling with his feeling that Trump is \"telling the truth\" about world issues. Alex seems to be caught between wanting to defend the paranoid worldview that Trump espouses and not wanting to have to be associated with such a ridiculous candidate.\n*Alex claims to have information from a \"high level source\" that Trump is deeply connected to the mob, going so far as to say \"with a name like Corleone, you get arrested; with a name like Trump you don't.\" This is very explicit, and is a very big problem when taken in combination with Alex's current position on Trump, namely that he would \"die for him.\"\n*Alex cites a Newseum poll that claims that only 19% of respondents were \"able to\" say that the 1st Amendment to the Constitution guarantees freedom of religion. Here is the article about the study, which if you read closely, you will see is methodologically flawed. The way the questions are phrased alone calls this poll into question. Also, this statistic is not abnormal for their polling: since 1997, they've never shown a higher percentage than 29% of respondents that know about the freedom of religion. Overall, this is a bad poll, on top of that, Alex is using it poorly.\n*Alex, who on past shows has said explicitly that he owns multiple Nazi guns, is very offended that people are offended by the Confederate flag, and Confederate memorabilia being sold at flea markets. He takes up a lot of his time complaining about this.\n*Alex insists that \"trendies\" only like Muslims because they think hookahs are cool.\n",
      "The world on July 13th<ref>[https://knowledgefight.com/the-past/2015/7/13/july-13-2015 July 13, 2015]</ref>:\n\n*Coming Soon\n\nWhat Alex covered on July 13, 2015:\n\n*Alex explains that Donald Trump is \"from the WWE,\" and unlike Jesse Ventura who grew out of that stuff, Trump treats the real world like pro wrestling. He goes on to say that you'd have to be stupid not to see through the charade of him faking being against Hillary.\n*Alex is starting to show an affinity for Russia and Vladimir Putin. His version is that they are one of the only countries left that is still \"male,\" which just taken alone is a weird position. He thinks that Russia is the only major country in the world that is standing up to Globalism, not realizing that there is another possibility, namely, that the civilized world sees a legitimate threat in Putin, and is largely unified against him. Alex is beginning to make clear that he sides with Russia.\n*Alex reveals that he is related to the Tudors. In the past, he's also revealed that he is related to Confederate general Nathan Bedford Forest, and the guy who \"invented the stock market.\" Alex constantly brags about his lineage, but beyond making wild pronouncements, none of this is ever proven.\n*Alex \"takes one look at Trump, and thinks danger Will Robinson.\" He still absolutely does not trust Trump, and is still firmly in the Rand Paul camp.\n*Alex says that \"casino owners are slimy,\" and literally calls Trump a predator.\n*Alex conducts a long interview with Anthony Gucciardi, which is really just an infomercial for his products, something that is happening more and more lately. In this installment, they give the backstory of Dr. Group. The real backstory is that he's not really a doctor, but actually a chiropractor. Their version is much better, and involves his dad being an evil scientist who created many of the toxins that are hurting humanity currently. At a certain point, Group rebelled against his father and made it his life's work to undo the damage he had done to the innocents of Earth. It's absolute drivel, and even pitched as a comic book character origin story, it would be \"a little derivitive.\"\n"
    ],
    "mediawiki_description": "Today, Dan tells Jordan all about the third installment of his investigation into what happened to Alex Jones in 2015 to get him on board with the Trump campaign. Topics covered include:\n\n*What InfoWars employee's uncle is investigating Sandy Hook?\n*What is a \"controlled rage?\"\n*Does Larry Nichols outdo himself in terms of dumb theories?\n*How mad can one man get at a trailer for an MTV show?\n",
    "next_episode_number": "50",
    "next_title": "50: Bohemian Grove...Ya Busted",
    "notable_bits": [],
    "ofile": "kf_wiki_content/49{{COLON}}_July_6-13._2015.wiki",
    "ooc_drop": null,
    "people": [
      "Gerald Celente",
      "Lord Monckton",
      "Rob Dew",
      "John Dew",
      "David Knight"
    ],
    "prev_episode_number": "48",
    "prev_title": "48: May 31, 2017",
    "release_date": "June 5, 2017",
    "safe_clean_title": "July 6-13. 2015",
    "safe_next_title": "50: Bohemian Grove...Ya Busted",
    "safe_prev_title": "48: May 31, 2017",
    "safe_title": "49: July 6-13. 2015",
    "slug": "49{{COLON}}_July_6-13._2015",
    "sortkey": "#_EPISODE_0049:July 6-13. 2015",
    "sources": [],
    "themes": [
      "Gerald Celente First Blood",
      "First mention of Lord Monckton",
      "Rob Dew's uncle John Dew is investigating Sandy Hook",
      "Alex says Sandy Hook is totally made up",
      "Men are made to protect nests",
      "Terminator is real",
      "Alex compares himself to MLK, says he's been attacked by black people more than MLK was attached by white people",
      "Dudes listen to David Knight willingly",
      "Alex says Trump is connected to the Mob",
      "Dan misses Chic-fil-a Alex"
    ],
    "title": "49: July 6-13. 2015"
  },
  {
    "beverage": null,
    "categories": [
      "Sandy Hook Investigation"
    ],
    "clean_title": "January 4-6, 2013",
    "coverage_date": null,
    "coverage_end_date": "January 6, 2013",
    "coverage_start_date": "January 4, 2013",
    "details_html": "<div class=\"libsyn-item-body\">\n<p>Today, Dan and Jordan have had enough of 2019 Alex Jones for this week, so they retreat to the past to continue their investigation into Alex's behavior in the aftermath of Sandy Hook. In this installment, the gents meet a truly insane small town police chief and find Alex coming off really petty about media bookings.</p>\n</div>",
    "download_link": "https://traffic.libsyn.com/secure/knowledgefight/Jan4-6-2013.mp3",
    "embed_player_url": "https://html5-player.libsyn.com/embed/episode/id/9366566/height/90/theme/custom/thumbnail/yes/direction/forward/tdest_id/461807/render-playlist/no/custom-color/87A93A/",
    "episode_length": "01:25:24",
    "episode_number": "283",
    "episode_type": "Sandy Hook Investigation",
    "libsyn_page": "https://knowledgefight.libsyn.com/knowledge-fight-january-4-6-2013",
    "mediawiki_citations": [],
    "mediawiki_description": "Today, Dan and Jordan have had enough of 2019 Alex Jones for this week, so they retreat to the past to continue their investigation into Alex's behavior in the aftermath of Sandy Hook. In this installment, the gents meet a truly insane small town police chief and find Alex coming off really petty about media bookings.\n",
    "next_episode_number": "284",
    "next_title": "284: April 12, 2019",
    "notable_bits": [],
    "ofile": "kf_wiki_content/283{{COLON}}_January_4-6,_2013.wiki",
    "ooc_drop": "You won't take our guns, Russia!",
    "people": [
      "Liz Wahl",
      "Jim Stachowiak",
      "Abby Martin",
      "Paul Craig Roberts",
      "Larry Pratt",
      "Old Man Housephone",
      "Diane Feinstein",
      "William Strauss",
      "Neil Howe",
      "Steve Bannon",
      "David Knight",
      "Mark Kessler",
      "Thomas Jefferson",
      "Matt Carson",
      "Marylou Hannon",
      "Robert Wagner",
      "Bill Ayers"
    ],
    "prev_episode_number": "282",
    "prev_title": "282: April 5, 2019",
    "release_date": "April 12, 2019",
    "safe_clean_title": "January 4-6, 2013",
    "safe_next_title": "284: April 12, 2019",
    "safe_prev_title": "282: April 5, 2019",
    "safe_title": "283: January 4-6, 2013",
    "slug": "283{{COLON}}_January_4-6,_2013",
    "sortkey": "#_EPISODE_0283:January 4-6, 2013",
    "sources": [
      "The Fourth Turning",
      "On A Hill They Call Capital: A Revolution Is Coming"
    ],
    "themes": [
      "RT is trying to defame Alex",
      "Alex is mad a Russia?",
      "Discussiont: RT/Liz Wahl on Sandy Hook",
      "Jim Stachowiak on RT",
      "Is Alex lashing out to get back on RT?",
      "Globalists want civil war",
      "Alex predicted shootings",
      "Larry Pratt: What if the teacher had a gun?",
      "Alex sets up Larry to lie, Larry flubs it",
      "Alex says Russia is merging with Obama",
      "Alex plugs his MLM off of a call",
      "Old Man Housephone prank calls Diane Feinstein",
      "Discussion: Historical Cycles",
      "Bannon is a supporter of the idea of cycles",
      "David Knight did a special piece on cycles",
      "Alex tells everyone to shut up",
      "Alex says SH is scripted",
      "Police chief Mark Kessler (guest) wants to set up a gun heaven",
      "Alex talks secession",
      "Discussion: Kessler's background",
      "Oathkeepers wouldn't work with Kessler",
      "Kessler has his own militia",
      "Alex: Gang killings aren't real deaths",
      "Alex \"quotes\" Jefferson on second amendment",
      "Quote actually comes from 2007 book",
      "Gotta be political before you're violent",
      "Mayor Marylou Hannon supports Kessler",
      "Robert Wagner sued Kessler for arresting, strip searching, and holding Wagner",
      "Kessler claimed he was undercover with Feds",
      "Caller: Illinois is going to take guns, just how Federal Reserve was passed with 3 votes",
      "Alex: Bill Ayers told Obama they'd take out opponents",
      "Alex's VO guy misquotes Jefferson as well",
      "Dan and Jordan check voice mail"
    ],
    "title": "283: January 4-6, 2013"
  }
]